# Exercises

Create a notebook or python script named `advanced_dataframes` to do your work in for this exercise.

For the following exercises, you'll need to load several datasets using the `pydataset` library. (If you get an error when trying to run the import below, use `pip` to install the `pydataset` package.)

In [1]:
from pydataset import data
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

from pydataset import data

When the instructions say to load a dataset, you can pass the name of the dataset as a string to the `data` function to load the dataset. You can also view the documentation for the data set by passing the `show_doc` keyword argument.

In [3]:
mpg = data('mpg') # load the dataset and store it in a variable
# data('mpg', show_doc=True) # view the documentation for the dataset

1. Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [4]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [5]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [6]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [7]:
#I'm just doing a little data prep here to get my DataFrame the way I left it in the DataFrames exercises and clean up column names.
mpg.columns.tolist()

['manufacturer',
 'model',
 'displ',
 'year',
 'cyl',
 'trans',
 'drv',
 'cty',
 'hwy',
 'fl',
 'class']

In [8]:

# Renaming city and highway columns.

mpg.columns = ['manufacturer', 'model', 'displacement', 'year', 'cylinders', 'transmission', 'drive', 'city','highway', 'fuel', 'class']

In [9]:
# Creating average_mileage and mileage_difference columns.

mpg = mpg.assign(mileage_difference = mpg.highway - mpg.city,
                 average_mileage = (mpg.city + mpg.highway) / 2)

mpg.head()

,manufacturer,model,displacement,year,cylinders,transmission,drive,city,highway,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

1a. On average, which manufacturer has the best miles per gallon?

In [10]:
# Here I perform my groupby and aggregation and sort the values.

mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False).round(2)
# Here I perform my groupby and aggregation with .nlargest().

mpg.groupby('manufacturer').average_mileage.mean().nlargest(1, keep='all')
# Here I perform my groupby and aggregation with .idxmax().

mpg.groupby('manufacturer').average_mileage.mean().idxmax()

'honda'

No matter if I look at the average city mileage, average highway mileage, or the average average mileage (which I hear is a mathematical sin), Honda is the winner here.

In [11]:
# I can also perform that aggregation on a list of columns and sort by one.

mpg.groupby('manufacturer')[['city', 'highway', 'average_mileage']].mean().sort_values(by='average_mileage', ascending=False).round(2)

               city  highway  average_mileage
manufacturer
honda         24.44    32.56            28.50
volkswagen    20.93    29.22            25.07
hyundai       18.64    26.86            22.75
subaru        19.29    25.57            22.43
audi          17.61    26.44            22.03
toyota        18.53    24.91            21.72
pontiac       17.00    26.40            21.70
nissan        18.08    24.62            21.35
chevrolet     15.00    21.89            18.45
ford          14.00    19.36            16.68
mercury       13.25    18.00            15.62
jeep          13.50    17.62            15.56
dodge         13.14    17.95            15.54
lincoln       11.33    17.00            14.17
land rover    11.50    16.50            14.00


Multi-column groupby:
- I can .groupby() multiple columns and go more granular.
- What if I wanted to know which manufacturer and model gets the best highway mileage?

In [12]:
multi_models = mpg.groupby(['manufacturer', 'model'])[['highway']].agg(['mean', 'count']).sort_values(by=('highway', 'mean'), ascending=False)

multi_models.columns = ['highway_mean', 'highway_count']
# Which manufacturer and model get the best highway mileage?

multi_models.nlargest(1, 'highway_mean', keep='all')

                      highway_mean  highway_count
manufacturer model
toyota       corolla          34.0              5

1b. How many different manufacturers are there?

In [13]:
mpg['manufacturer'].nunique()

15

In [14]:
mpg.manufacturer.nunique()

15

In [15]:
mpg.manufacturer.describe()

count       234
unique       15
top       dodge
freq         37
Name: manufacturer, dtype: object

1c. How many different models are there?

In [16]:
mpg['model'].nunique()

38

In [17]:
mpg.model.nunique()

38

In [18]:
mpg.model.describe()

count             234
unique             38
top       caravan 2wd
freq               11
Name: model, dtype: object

1d. Do automatic or manual cars have better miles per gallon?

In [19]:
# I check the values in the `transmission` column to see what I'm working with.

mpg.transmission.value_counts()
mpg['transmission_category'] = np.where(mpg.transmission.str.startswith('a'), 'auto', 'manual')
# The average mileage of manual transmission cars is better per gallon, city or highway.

mpg.groupby('transmission_category')[['city', 'highway']].mean()

                            city    highway
transmission_category
auto                   15.968153  22.292994
manual                 18.675325  25.779221

2. Joining and Merging

In [20]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users
#some users have no role (NaN)

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [21]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles
#Somes roles without users

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2a. Copy the users and roles dataframes from the examples above. What do you think a right join would look like? An outer join? What happens if you drop the foreign keys from the dataframes and try to merge them?

- What do you think a right join would look like

In [22]:
pd.merge(users, roles, on='id', how='right')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter

In [23]:

right_join = pd.merge(users, 
                      roles, 
                      left_on='role_id', 
                      right_on='id', 
                      how='right',
                      indicator=True)
right_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

- What do you think a outer join would look like

In [24]:
pd.merge(users, roles, on='id', how='outer')

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter
4   5   jane      NaN        NaN
5   6   mike      NaN        NaN

In [25]:
pd.merge(users, 
         roles, 
         left_on='role_id', 
         right_on='id', 
         how='outer',
        indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

- What happens if you drop the foreign keys from the dataframes and try to merge them?

In [26]:
users_drop = users.drop(columns='role_id')
users_drop

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [27]:
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [28]:
# The result is not good. Now Adam is a commenter, and that is not true.

pd.merge(users_drop, roles, on='id')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter

In [29]:

# Here is how they should be joined. Adam is a reviewer.

pd.merge(users, roles, left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y    name_y
0     1    bob      1.0     1     admin
1     2    joe      2.0     2    author
2     3  sally      3.0     3  reviewer
3     4   adam      3.0     3  reviewer

3. Getting data from SQL databases

In [30]:
from env import host, user, password

3a. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [31]:
get_db_url= f'mysql+pymysql://{user}:{password}@{host}/employees'

3b. Use your function to obtain a connection to the employees database.

In [32]:
pd.read_sql('select * from employees limit 5', get_db_url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [33]:
sql_query = 'SELECT * FROM employees'
employees = pd.read_sql(sql_query, get_db_url('employees'))
employees.to_csv('employees.csv')
employees = pd.read_csv('data/employees.csv', index_col=0)
employees.head()
##faiths code but idk how it is not working here. whats up with str employees not being able to be call?

TypeError: 'str' object is not callable

3c. Once you have successfully run a query:

In [ ]:
sql = '''
select emp_no, first_name, last_name
from employees
where gender = 'F'
limit 5
offset 200
'''

pd.read_sql(sql, get_db_url)

    - 3c.1 - Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
bad_url= f'mysql+pymysql://{user}:{password}@{host}/emplyees'

sql = '''
select emp_no, first_name, last_name
from employees
where gender = 'F'
limit 5
offset 200
'''

pd.read_sql(sql, bad_url)

    - 3c.2 - Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
get_db_url= f'mysql+pymysql://{user}:{password}@{host}/employees'
sql = '''
select emp_no, first_name, last_name
from emplyees
where gender = 'F'
limit 5
offset 200
'''

pd.read_sql(sql, get_db_url)

3d. Read the employees and titles tables into two separate dataframes

In [ ]:
employees = pd.DataFrame(pd.read_sql('select * from employees', get_db_url))
titles = pd.DataFrame(pd.read_sql('select * from titles', get_db_url))
pd.merge(employees, titles, on='emp_no').head()

3e. Visualize the number of employees with each title.

In [ ]:
titles.head(1)

In [ ]:
titles.shape

In [ ]:
titles.to_date.min()

In [ ]:
titles.to_date.max()

In [ ]:

# Create a boolean Series to filter for current titles held.

current_bool = titles.to_date == titles.to_date.max()
current_bool.head()

In [ ]:
# Filter my Series and assign to current_employees_titles.

current_employee_titles = titles[current_bool]
current_employee_titles.head()

In [ ]:
# I'm down to 240_124 rows from 443_308 rows before.

current_employee_titles.shape

In [ ]:
# Our dimension is title and our metric is the count of employees, emp_no.

current_employee_titles.groupby('title').emp_no.count()

In [ ]:
# Use value_counts on the title column to get the frequency for each title. 
# My index values are the titles, values the count of employees with that title.

current_title_values = current_employee_titles.title.value_counts()
current_title_values

In [ ]:

# This shows the number of current employees who hold each title.

current_title_values.plot.barh(color='paleturquoise', 
                               ec='c', 
                               width=.8)

plt.title('Count of Employees Current Title')
plt.xlabel('# of Employees')

# Reverse order of y-axis for horizontal bar chart
plt.gca().invert_yaxis()

plt.show()

3f. Join the employees and titles dataframes together.

In [ ]:
query = '''
select *
from employees
join titles using (emp_no)
'''

employees_with_title = pd.read_sql(query, get_db_url)
employees_with_title.head()

3g. Visualize how frequently employees change titles.

In [ ]:
# emp_no is our dimension and count of title is our metric.

employees_with_title.groupby('emp_no').title.count().sample(10)

In [ ]:

# Now let's get a count of the values above; we can use value_counts()

employees_with_title.groupby('emp_no').title.count().value_counts()

In [ ]:
# Get the frequency each emp_no appears in the df. Save to a Series called changes.

changes = employees_with_title.emp_no.value_counts()
changes.sample(5)

In [ ]:
# Now, I can do a value_counts on changes to get a count of 1s, 2s, 3s.

changes.value_counts()

In [ ]:
# Plot changes.value_counts() from above.
# 0 changes == 1 title 
# 1 change  == 2 titles 
# 2 changes == 3 titles

changes.value_counts().plot(kind='barh', 
                            color='paleturquoise', 
                            ec='c', 
                            width=.8)

plt.title('How Common is it for Employees to Change Titles?')
plt.xlabel('Number of Employees')
plt.ylabel('Number of Title Changes')
plt.yticks(ticks=[0,1,2], labels=['0 Changes', '1 Change', '2 Changes'])

# reorder y-axis of horizontal bar chart
plt.gca().invert_yaxis()

plt.show()

3h. For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
employees_with_title.groupby('title').hire_date.max()

3i. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL and python/pandas code)

In [ ]:
dept_title_query = '''

                    SELECT t.emp_no, 
                    t.title, 
                    t.from_date, 
                    t.to_date, 
                    d.dept_name 
                    FROM departments AS d 
                    JOIN dept_emp AS de USING(dept_no) 
                    JOIN titles AS t USING(emp_no);

                    '''

In [ ]:
employees = pd.DataFrame(pd.read_sql('select * from employees', get_db_url))
titles = pd.DataFrame(pd.read_sql('select * from titles', get_db_url))

In [ ]:
# Code that originally read in my data from the database
dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))

In [ ]:
# Code that wrote my data to a csv file for faster access.
dept_titles.to_csv('dept_titles.csv')

In [ ]:
# Read in data from a CSV file instead of repeatedly hitting database.

dept_titles = pd.read_csv('data/dept_titles.csv', index_col=0)
dept_titles.head()

In [ ]:
dept_titles.shape

In [ ]:
# Create a frequency table of titles by department

all_titles_crosstab = pd.crosstab(dept_titles.dept_name, dept_titles.title)
all_titles_crosstab

In [ ]:
# Create a subset of only titles currently held by employees

current_titles = dept_titles[dept_titles.to_date == dept_titles.to_date.max()]
current_titles.head(1)

In [ ]:
current_titles.shape

In [ ]:
# Create a frequency table of titles by department

current_titles_crosstab = pd.crosstab(current_titles.dept_name, current_titles.title)
current_titles_crosstab

4. Use your get_db_url function to help you explore the data from the chipotle database. Use the data to answer the following questions:

In [ ]:
chipotle_sql_query = '''
                     SELECT *
                     FROM orders;
                     '''

In [ ]:
from env import host, user, password

In [ ]:
get_db_url= f'mysql+pymysql://{user}:{password}@{host}/chipotle'
get_db_url

In [ ]:
orders = pd.read_sql(chipotle_sql_query, get_db_url('chipotle'))
orders.head()

4a. What is the total price for each order?

In [ ]:
# Reassign my cleanup to item_price in my df.

orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)
orders.info()

In [ ]:
order_totals = orders.groupby('order_id').item_price.sum()
order_totals.sample(10)

4b. What are the most popular 3 items?

In [ ]:
top_three = orders.groupby('item_name').quantity.sum().sort_values(ascending=False).head(3)
top_three.plot(kind='barh',
             color='blueviolet', 
             ec='black', 
             width=.8)

plt.title('The Big Three at Chipotle')
plt.xlabel('Number of Items Ordered')
plt.ylabel('Menu Item')

# reorder y-axis of horizontal bar chart
plt.gca().invert_yaxis()

plt.show()

4c. Which item has produced the most revenue?

In [ ]:
orders.sample(5)

In [ ]:
# I can return the item(s) with the highest revenue using .nlargest().

orders.groupby('item_name').item_price.sum().nlargest(1, keep='all')
# This way I get just the item name with the highest revenue.

orders.groupby('item_name').item_price.sum().idxmax()
# I could sort my values and return the top ones using .head() if I wanted.

orders.groupby('item_name').item_price.sum().sort_values(ascending=False).head(1)